import time
# 2 <= N <= 1000 , 1 <= M <= 10000 , 1 <= K <= 10000
N,M,K = map(int,input().split())
수열 = list(map(int,input().split()))
start = time.time()
가장큰수 = 수열.pop(수열.index(max(수열)))
두번째큰수 = 수열.pop(수열.index(max(수열)))

# M // K = 총 M을 K로 나누면 두 번째 큰 수가 총 몇 번 들어갈 수 있는 지 알 수 있다.
# M에서 M//K를 빼면 가장 큰 수가 몇 번 반복되는지 알 수 있다.
answer = M//K * 두번째큰수 + 가장큰수*(M-M//K)
print(answer)

#걸린시간
print("time :", time.time() - start)

"""
import time
# 2 <= N <= 1000 , 1 <= M <= 10000 , 1 <= K <= 10000
N,M,K = map(int,input().split())
수열 = list(map(int,input().split()))

start = time.time()

cnt = 0
total = 0
가장큰수 = 수열.pop(수열.index(max(수열)))
두번째큰수 = 수열.pop(수열.index(max(수열)))
while cnt != M:
    cnt+=1
    if cnt%K == 0:
        total+=두번째큰수
    else:
        total+=가장큰수
print(total)

#걸린시간
print("time :", time.time() - start)
"""



"""
5 8 3
2 4 5 4 6
출력 46

5 7 2
3 4 3 4 3
출력 28
"""

"""
102 9999 8
10000 9999 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000 8000
"""
